const getMensajeSistema = () => ({
  smsrowner: `🚫 \`𝗘𝗹 𝗰𝗼𝗺𝗮𝗻𝗱𝗼 𝘀𝗼𝗹𝗼 𝗽𝘂𝗲𝗱𝗲 𝘀𝗲𝗿 𝘂𝘀𝗮𝗱𝗼 𝗽𝗼𝗿 𝗺𝗶 𝗰𝗿𝗲𝗮𝗱𝗼𝗿, 𝘁𝘂 𝗮𝗰𝗰𝗲𝘀𝗼 𝗻𝗼 𝗲𝘀𝘁𝗮 𝗮𝘂𝘁𝗼𝗿𝗶𝘇𝗮𝗱𝗼\``,
  
  smsowner: `🚫 \`𝗘𝗹 𝗰𝗼𝗺𝗮𝗻𝗱𝗼 𝘀𝗼𝗹𝗼 𝗽𝘂𝗲𝗱𝗲 𝘀𝗲𝗿 𝘂𝘀𝗮𝗱𝗼 𝗽𝗼𝗿 𝗹𝗼𝘀 𝗱𝗲𝘀𝗮𝗿𝗿𝗼𝗹𝗹𝗮𝗱𝗼𝗿𝗲𝘀 𝗱𝗲𝗹 𝗯𝗼𝘁, 𝗻𝗼 𝘁𝗶𝗲𝗻𝗲𝘀 𝗽𝗲𝗿𝗺𝗶𝘀𝗼𝘀 𝗻𝗲𝗰𝗲𝘀𝗮𝗿𝗶𝗼𝘀.\``,
  
  smsmods: `🚫 \`𝗦𝗼𝗹𝗼 𝗹𝗼𝘀 𝗱𝗲𝘀𝗮𝗿𝗿𝗼𝗹𝗹𝗮𝗱𝗼𝗿𝗲𝘀 𝗮𝘂𝘁𝗼𝗿𝗶𝘇𝗮𝗱𝗼𝘀 𝗽𝘂𝗲𝗱𝗲𝗻 𝗲𝗷𝗲𝗰𝘂𝘁𝗮𝗿 𝗲𝘀𝘁𝗮 𝗳𝘂𝗻𝗰𝗶𝗼𝗻.\``,
  
  smspremium: `🧙‍♂️ \`𝙀𝙨𝙩𝙖 𝙛𝙪𝙣𝙘𝙞𝙤𝙣 𝙚𝙨𝙩𝙖 𝙙𝙞𝙨𝙥𝙤𝙣𝙞𝙗𝙡𝙚 𝙪𝙣𝙞𝙘𝙖𝙢𝙚𝙣𝙩𝙚 𝙥𝙖𝙧𝙖 𝙪𝙨𝙪𝙖𝙧𝙞𝙤𝙨 𝙥𝙧𝙚𝙢𝙞𝙪𝙢.`,
  
  smsgroup: `⁉️ \`𝗘𝗹 𝗰𝗼𝗺𝗮𝗻𝗱𝗼 𝘀𝗼𝗹𝗼 𝘀𝗲 𝗽𝘂𝗲𝗱𝗲 𝘂𝘀𝗮𝗿 𝗲𝗻 𝗴𝗿𝘂𝗽𝗼𝘀.\``,
  
  smsprivate: `🔒 \`𝗘𝗹 𝗰𝗼𝗺𝗮𝗻𝗱𝗼 𝘀𝗼𝗹𝗼 𝗽𝘂𝗲𝗱𝗲 𝘀𝗲𝗿 𝘂𝘀𝗮𝗱𝗼 𝗲𝗻 𝗲𝗹 𝗰𝗵𝗮𝘁 𝗽𝗿𝗶𝘃𝗮𝗱𝗼 𝗱𝗲𝗹 𝗯𝗼𝘁.\``,
  
  smsadmin: `💎 \`𝗘𝗹 𝗰𝗼𝗺𝗮𝗻𝗱𝗼 𝘀𝗼𝗹𝗼 𝗲𝘀𝘁𝗮 𝗿𝗲𝘀𝗲𝗿𝘃𝗮𝗱𝗼 𝗽𝗮𝗿𝗮 𝗮𝗱𝗺𝗶𝗻𝗶𝘀𝘁𝗿𝗮𝗱𝗼𝗿𝗲𝘀 𝗱𝗲𝗹 𝗴𝗿𝘂𝗽𝗼.\``,
  
  smsbotAdmin: `🎄 \`𝗣𝗮𝗿𝗮 𝗲𝗷𝗲𝗰𝘂𝘁𝗮𝗿 𝗲𝗹 𝗰𝗼𝗺𝗮𝗻𝗱𝗼 𝗱𝗲𝗯𝗼 𝘀𝗲𝗿 𝗮𝗱𝗺𝗶𝗻𝗶𝘀𝘁𝗿𝗮𝗱𝗼𝗿 𝗱𝗲𝗹 𝗴𝗿𝘂𝗽𝗼.\``,
  
  smsrestrict: `*_¡Esta característica está -deshabilitada-_*`,


  smsqr: `╭─〔 🔰 𝗦𝗨𝗞𝗨𝗡𝗔 - 𝗕𝗢𝗧™ 🔰 〕─╮
│
│ 🌀 𝐄𝐬𝐜𝐚𝐧𝐞𝐚 𝐞𝐥 𝐜ó𝐝𝐢𝐠𝐨 𝐐𝐑 𝐮𝐬𝐚𝐧𝐝𝐨 
│     𝐨𝐭𝐫𝐨 𝐜𝐞𝐥𝐮𝐥𝐚𝐫 𝐨 𝐮𝐧𝐚 𝐏𝐂 💻📱
│     𝐲 𝐜𝐨𝐧𝐯𝐢é𝐫𝐭𝐞𝐭𝐞 𝐞𝐧 𝐮𝐧 𝐒𝐮𝐛 𝐁𝐨𝐭 🎉
│
├─ 📝 *Pasos para vincular:*
│
│ 🌾 *1.* Presiona los ⋮ en la esquina
│       superior derecha.
│ 🌷 *2.* Toca "*Dispositivos vinculados*".
│ 🔹 *3.* Escanea el código QR para
│       *iniciar sesión* 🚀
│
├─⏳ *Este QR expira en:* *45 segundos*
╰━━━━━━━━━━━━━━━━━━━━━━━╯`,

  smscode: `
 ╔═══⊹⊱『 𝐒𝐔𝐊𝐔𝐍𝐀 - 𝐁𝐎𝐓™ 』⊰⊹═══╗

🔮 *Invocación de Sub-Bot activada...*

⟿ 💛 Usa el siguiente *código único* para convertirte en un Sub-Bot del reino oscuro 👁️‍🗨️

☠️ 𝐏𝐀𝐒𝐎𝐒 𝐃𝐄 𝐕𝐈𝐍𝐂𝐔𝐋𝐀𝐂𝐈𝐎𝐍 ☠️

➤ \`1\` Pulsa los ⋮ tres puntos (arriba a la derecha)  
➤ \`2\` Toca en *Dispositivos vinculados*  
➤ \`3\` Selecciona *Vincular con número de teléfono*  
➤ \`4\` Escribe el *código maldito* 🩸

⚠️ Este código *solo funcionará* en el número que lo solicitó.  
❗ *No uses tu cuenta principal*, podrías perderla en el dominio de las sombras...

╚═════════⊹⊱🌷⊰⊹═════════╝`
})

export default getMensajeSistema